<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/pandas13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
l1 =[{'name':'John','job':'teacher'},
    {'name':'Nate','job':'student'},
    {'name':'Fred','job':'developer'}]

l2 =[{'name':'Ed','job':'dentist'},
    {'name':'Jack','job':'farmer'},
    {'name':'Ted','job':'designer'}]

l3 =[{'name':'John','job':'teacher'},
    {'name':'Nate','job':'student'},
    {'name':'Jack','job':'developer'}]

l4 =[{'age':25,'country':'U.S'},
     {'age':30,'country':'U.K'},
     {'age':45,'country':'Korea'},
   ]

In [ ]:
df1=pd.DataFrame(l1,columns =['name','job'])
df2=pd.DataFrame(l2,columns = ['name','job'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [ ]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

두 데이터프레임을 행으로 합치기(변수만들어서)

In [ ]:
result = pd.concat([df1,df2],ignore_index=True)

In [ ]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

인덱스 동일하게 하나씩 커지도록 생성

In [ ]:
result = df1.append(df2,ignore_index=True)

In [ ]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [ ]:
df1=pd.DataFrame(l3,columns =['name','job'])
df2=pd.DataFrame(l4,columns = ['age','country'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [ ]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

열로 합치기

In [ ]:
result = pd.concat([df1,df2],axis =1 , ignore_index=True)

In [ ]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

In [ ]:
label = [1,2,3,4,5]
prediction=[1,2,2,4,4]

In [ ]:
comparision = pd.DataFrame({'label':label,'prediction':prediction})

In [ ]:
comparision

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4